tests/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 100
      name: "Warm up phase"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Chat API Load Test"
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            name: "Load Test User"
            email: "loadtest@example.com"
            password: "password123"
          capture:
            json: "$.token"
            as: "token"
      - think: 1
      - post:
          url: "/api/v1/chat/messages"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            receiverId: "64f1a2b3c4d5e6f7a8b9c0d1"
            content: "Load test message"
      - think: 1
      - get:
          url: "/api/v1/chat/messages/64f1a2b3c4d5e6f7a8b9c0d1"
          headers:
            Authorization: "Bearer {{ token }}"